#!/usr/bin/env bash
# Author: Openset
# Home: https://github.com/openset

# ------------------------------------------------------------------------
# 注释
# ------------------------------------------------------------------------
# 以"#"开头的行就是注释，会被解释器忽略。
# sh里没有多行注释，只能每一行加一个#号。
# 多行注释(非语法)
:<<EOF
注释内容...
注释内容...
注释内容...
EOF

# 输出
echo "Hello World !"

# ------------------------------------------------------------------------
# 变量类型
# 1 局部变量
# 2 环境变量 
# 3 shell变量
# ------------------------------------------------------------------------
# 变量
name="Sandy"
echo $name
echo ${name}
# 只读变量
readonly PI=3.1415926
echo PI
# 删除变量
t='abc'
unset t

# ------------------------------------------------------------------------
# 字符串
# ------------------------------------------------------------------------
# 单引号
str='this is a string'
echo $str
# 双引号
str="Hello, I know you are \"$name\"!"
echo $str
# 拼接字符串
world="world"
# 使用双引号拼接
greeting="hello, "$world" !"    # hello, world !
greeting_1="hello, ${world} !"  # hello, world !
echo $greeting  $greeting_1
# 使用单引号拼接
greeting_2='hello, '$world' !'  # hello, world !
greeting_3='hello, ${world} !'  # hello, ${world} !
echo $greeting_2  $greeting_3
# 获取字符串长度
string="Hello"
echo ${#string}     # 5
# 提取子字符串
string="I love china!"
echo ${string:0:4}  # I lo

# ------------------------------------------------------------------------
# 数组
# ------------------------------------------------------------------------
# 定义数组
array_name=('value0' 'value1' 'value2' 'value3')
# 读取数组
# 使用 @ 符号可以获取数组中的所有元素
echo ${array_name[@]}   # value0 value1 value2 value3
echo ${array_name[0]}   # value0
echo ${array_name[2]}   # value2
# 获取数组的长度
# 取得数组元素的个数
length=${#array_name[@]}
echo $length            # 4
# 或者
length=${#array_name[*]}
echo $length            # 4
# 取得数组单个元素的长度
length=${#array_name[1]}
echo $length            # 6

# ------------------------------------------------------------------------
# 传递参数
# ------------------------------------------------------------------------
# 我们可以在执行 Shell 脚本时，向脚本传递参数，脚本内获取参数的格式为：$n。
# n 代表一个数字，0 为执行的文件名, 1 为执行脚本的第一个参数，2 为执行脚本的第二个参数，以此类推……
# 执行的文件名
echo $0     # ./learn.bash
# 传递到脚本的参数个数
echo $#	    # 3
# 以一个单字符串显示所有向脚本传递的参数。
# 如"$*"用「"」括起来的情况、以"$1 $2 … $n"的形式输出所有参数。
echo $*	    # a b c
# 脚本运行的当前进程ID号
echo $$	    # 3664
# 后台运行的最后一个进程的ID号
echo $!     # 3670
# 与$*相同，但是使用时加引号，并在引号中返回每个参数。
# 如"$@"用「"」括起来的情况、以"$1" "$2" … "$n" 的形式输出所有参数。
echo "$@"   # a b c
# 显示Shell使用的当前选项，与set命令功能相同。
echo $-     # hB
# 显示最后命令的退出状态。0表示没有错误，其他任何值表明有错误。
echo $?     # 0

